linux/linuxcast.org
#+TITLE: linuxCast 视频笔记
#+AUTHOR: Zhao WenBin

* 操作系统安装

** 流程

1. 准备 iso 光盘
2. grub 引导进入安装界面
3. 选择语言、时区（选 utc）、root 密码
4. 设定分区和挂载点（根目录和 swap 分区），swap 不建议过大
5. 选择 grub 引导设备
6. 选择软件包
7. 完成重启

** 其它

- 可以选择对硬盘加密，但会损失读写性能
- 除了常规的 MSDOS 分区外，还可以建立 LVM 或软件 RAID
- FCoE 等特殊存储设备

* 文件系统 

** 基本命令

1. 创建文件系统 mkfs.ext4 或 mkefs
2. 显示文件系统信息 dumpefs
3. 添加卷标 e2label
4. 检查修复 fsck

** 知识

- 文件块大小 blocksize 是读与写的最小单位
- fsck 在每次启动时自动进行，恢复的结果放在 =lost+found= 目录中
- fsck 文件系统不能被挂载
- 无文件系统称为裸盘（raw），oracle 中可能使用裸盘，以获取更佳性能优化



* 基本操作

** shell

shell 是用户与操作系统内核交互的中间层，是一个概念，有多种方式。比如 GUI 或 CLI。

** 用户命令

- =su root= :: 切换 root 权限，但目录保持不变
- =su - root= :: 切换 root 用户，重新登录
- 快捷键 =ESC + .= :: 重新调用前一个命令中的参数
- =logout= :: 退出当前 shell
- =exit= :: 退同当前账号身份

*** logout vs exit

参考 [[https://superuser.com/questions/314869/nohup-and-the-difference-between-logout-and-exit-on-a-remote-shell][Nohup and the difference between logout and exit on a remote shell]]

=logout= 是个 shell 内置的命令，具体作用与 shell 有关。zsh 中与 =exit= 一样。

唯一的区别在于对于 non-login shell，logout 的概念比较奇怪

** 任务

=Ctrl+Z= 将当前进程放在后台执行，但切换后会变成 stopped 状态，用 =bg= 命令激活之

** 文件系统

- =ls -ld= :: 显示当前目录和链接信息
- =cd -= :: 切换到上一个工作目录


** 其它命令

- =chvt= :: 切换 TTY
- =hdparm= :: 查看硬盘参数调试性能



